WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/meadow-upd-interrupt.c
/****************************************************************************
 * nuttx\configs\stm32f777zit6-meadow\src\meadow-upd-interrupt.c
 * 
 *   Copyright (C) 2020 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <string.h>

#include <nuttx/config.h>

#include <nuttx/fs/fs.h>
#include <nuttx/kmalloc.h>
#include <arch/board/board.h>
#include <nuttx/mqueue.h>
#include <nuttx/signal.h>
#include <nuttx/drivers/pwm.h>
#include <nuttx/spi/spi.h>

#include <stdbool.h>
#include <assert.h>
#include <debug.h>
#include <errno.h>

#include "chip.h"
#include "fcntl.h"
#include "stm32_pwm.h"
#include "stm32_i2c.h"
#include "stm32f777zit6-meadow.h"
#include "stm32_spi.h"

#include <dirent.h>

#include <sys/ioctl.h>

#include <nuttx/timers/timer.h>
#include <sys/ioctl.h>
#include "stm32_tim.h"
#include <nuttx/clock.h>    // for testing

#include "meadow-upd.h"

// DEVELOPER NOTE:
// Debounce recognizes the first state transition and then ignores anything after
//  that for a period of time.
// Glitch filtering ignores the first state transition and waits a period of time
//  and then looks at state to make sure the result is stable

#define MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG (0)    // 0 > will include

// A free STM32F7 timer
#define MEADOW_UPD_INTERRUPT_STM32F7_TIMER_NUMBER (10)

// This is the threshold any glitch duration greater than this value
// will use milliseconds timing instead of 100 usec timing.
#define MEADOW_UPD_GLITCH_TIME_TO_SWITCH_TO_MS (200)    // 200 == 20 milliseconds

#if CONFIG_USEC_PER_TICK == 1000
#define MEADOW_UPD_TICK_MILLISEC_FACTOR (10)   // GlitchRequestedDuration to milliseconds
#else
#define MEADOW_UPD_TICK_MILLISEC_FACTOR (1)    // GlitchRequestedDuration to milliseconds
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/
enum updInterruptProcState_e
{
  updipstate_uncfg,           // not configured
  updipstate_beingcfg,        // being configured
  updipstate_wait_gpio_isr,   // waiting for an interrupt from a gpio
  updipstate_mon_glitch,      // gpio is being monitored for glitch
  updipstate_mon_debounce,    // gpio is being monitored for debounce
};

enum RequestedInterruptMode_e
{
  rqstdintmode_none,
  rqstdintmode_rising,
  rqstdintmode_falling,
  rqstdintmode_both
};

enum GlitchAndDebouceReturnValues_e
{
  gadrv_keepwaiting,
  gadrv_validtransitiondetected,
  gadrv_break,
};

// The following struct stores the informtion needed for debounce
struct interruptPinMap_s
{
  // Represents the CPU Pin identifier (e.g. PD9, D=3 so 39)
  const uint8_t PinId;
  // Address of the "Input Data Register" that holds GPIO port state bits
  const uint32_t IDRAddress;
  // CurrentProcessState - tracks the current processing state for this GPIO
  // defined by an entry in updInterruptProcState_e enum
  uint8_t CurrentProcessState;

  // Contains the configured interrupt mode: None = 0, Rising = 1, Falling = 2 and Both = 3;
  // Note: for mode 'None' configuration is not sent from Meadow.Core.
  uint8_t GpioInterruptMode;
  // LastKnownGpioState - Last known GPIO state (often last reported to Meadow.Core)
  uint8_t LastKnownGpioState;    // 1 = high, 0 = low, 0xff = unknown

  // The number of debounce timer timeouts needed to satisfy user's config
  int32_t DebounceRequestedDuration;
  // This counter counts down to zero, this ends the debounce period allowing
  // new GPIO interrupts to be received
  uint32_t DebounceDownCounter;

  // The number of valid states that must be the same to be stable
  uint32_t GlitchRequestedDuration;   // Supplied by Meadow.Core
  // The current number of states that have been the same
  uint32_t GlitchTimeoutsCounter;
  // The previous GPIO state that we must be matched to be declared stable
  uint8_t GlitchPrevGpioState;
  // TimeProcessingBegan is used for glitch timing when the glitch duration
  // is beyond a certain limit and for diagnostics.
  uint32_t TimeProcessingBegan;
};

// Each row represents one Meadow GPIO
// On board Blue, Green and Red (PA0, PA1, PA2) of course excluded
static struct interruptPinMap_s gpioDebounceData[] =
{
//                PinId     IDRAddress     Current State   GIM  LKS  DNT DDC GND STC PGS TTP
/* 00 A0   PA4*/  {0x04, STM32_GPIOA_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 01 A1   PA5*/  {0x05, STM32_GPIOA_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 02 A2   PA3*/  {0x06, STM32_GPIOA_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 03 A3   PA7*/  {0x07, STM32_GPIOA_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 04 A4   PC0*/  {0x20, STM32_GPIOC_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 05 A5   PC1*/  {0x21, STM32_GPIOC_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 06 SCK  PC10*/ {0x2A, STM32_GPIOC_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 07 MOSI PB5*/  {0x15, STM32_GPIOB_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 08 MOSO PC11*/ {0x2B, STM32_GPIOC_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 09 D00  PI9*/  {0x89, STM32_GPIOI_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 10 D01  PH13*/ {0x7D, STM32_GPIOH_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 11 D02  PC6*/  {0x26, STM32_GPIOC_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 12 D03  PB8*/  {0x18, STM32_GPIOB_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 13 D04  PB9*/  {0x19, STM32_GPIOB_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 14 D05  PC7*/  {0x27, STM32_GPIOE_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 15 D06  PB0*/  {0x10, STM32_GPIOG_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 16 D07  PB7*/  {0x17, STM32_GPIOB_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 17 D08  PB6*/  {0x16, STM32_GPIOB_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 18 D09  PB1*/  {0x11, STM32_GPIOC_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 19 D10  PH10*/ {0x7A, STM32_GPIOH_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 20 D11  PC9*/  {0x29, STM32_GPIOB_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 21 D12  PB14*/ {0x1E, STM32_GPIOB_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 22 D13  PB15*/ {0x1F, STM32_GPIOB_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 23 D14  PG3*/  {0x63, STM32_GPIOB_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0},
/* 24 D15  PE3*/  {0x43, STM32_GPIOC_IDR, updipstate_uncfg, 0, 0xff,  0,  0,  0,  0,  0,  0} 
};

#define MEADOW_UPD_F7_SUPPORTED_GPIOS (25)

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int upd_gpio_interrupt(int irq, void *context, void *arg);
static int upd_config_interrupt_prep_timer(int stm32_timer_numb);
static inline int upd_forward_interrupt_to_core(struct interruptPinMap_s *gpioMapTblPtr, uint8_t state);
static int upd_process_gpio_debounce(struct interruptPinMap_s *gpioMapTblPtr);
static int upd_process_gpio_glitch(struct interruptPinMap_s *gpioMapTblPtr);
static int upd_meadow_debounce_notification_logic(struct interruptPinMap_s *gpioMapTblPtr);
static inline uint8_t upd_read_current_gpio_state(struct interruptPinMap_s *gpioMapTblPtr);
static int upd_periodic_timeout_isr(int irq, void *context, void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

