WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/meadow-upd-interrupt.c
static bool _isInitializationNeeded = true;
static struct stm32_tim_dev_s *_periodicTimer;

// These are optimizations so we don't generate unnecessary interrupts
static volatile int numbGpioConfigured = 0;  // incremented and decrementd by config
static volatile int totalGpiosBeingMonitored = 0;   // increment by ISR decremented by exit

/****************************************************************************
 * Private Functions
 ****************************************************************************/
// There has been a transition on a GPIO pin that we've been ask to monitor
static int upd_gpio_interrupt(int irq, void *context, void *arg)
{  
  // Is there any work to do?
  if(numbGpioConfigured < 1)
    return OK;

  struct interruptPinMap_s *gpioMapTblPtr = (struct interruptPinMap_s *)arg;

  // Properly setup?
  if(gpioMapTblPtr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-PinId:0x%02x <unconfigured> gpioMapTblPtr == NULL\n",
            __FILE__, __LINE__, gpioMapTblPtr->PinId);
    return OK;
  }

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(GPIO isr)-0x%02x (P%c%d)- received interrupt\n",
            gpioMapTblPtr->PinId,
            ((gpioMapTblPtr->PinId) >> 4) + 'A', gpioMapTblPtr->PinId & 0x0f);
#endif

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  // Unless waiting for gpio interrupt, ignore
  if(gpioMapTblPtr->CurrentProcessState != updipstate_wait_gpio_isr)
  {
    // The updipstate_uncfg, updipstate_mon_glitch and updipstate_mon_debounce states
    // exit here. When work is finished the state is returned to updipstate_wait_gpio_isr.
    // Therefore, switch bouncing will exits here too
    syslog(LOG_INFO, "upd-(GPIO isr)--PinId:0x%02x ignored\n", gpioMapTblPtr->PinId);
    return OK;
  }
#endif

  // This GPIO is not being tracked so begin tracking
  // Check configuration to know what to do, glitch or debounce
  if(gpioMapTblPtr->GlitchRequestedDuration > 0)
  {
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_DEBUG, "upd-(GPIO isr)--PinId:0x%02x, Process glitch\n", gpioMapTblPtr->PinId);
#endif
    // Glitch always runs before Debounce if Debounce configured
    gpioMapTblPtr->GlitchTimeoutsCounter = 0;
    gpioMapTblPtr->CurrentProcessState = updipstate_mon_glitch;
    totalGpiosBeingMonitored++;
    STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_UP);
  }
  else if(gpioMapTblPtr->DebounceRequestedDuration > 0)
  {
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_DEBUG, "upd-(GPIO isr)--PinId:0x%02x, Process debounce\n", gpioMapTblPtr->PinId);
#endif

    gpioMapTblPtr->DebounceDownCounter = gpioMapTblPtr->DebounceRequestedDuration;
    gpioMapTblPtr->CurrentProcessState = updipstate_mon_debounce;
    totalGpiosBeingMonitored++;
    STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_UP);
  }
  else
  {
    // Both Glitch and Debounce durations are zero and the
    // interrupt mode is set, so read the state and send it
    // with no delay.
    uint8_t newState = upd_read_current_gpio_state(gpioMapTblPtr);
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_DEBUG, "upd-(GPIO isr)--PinId:0x%02x, Glitch and Debounce zero. Notify as:0x%02x (was::0x%02x\n",
        gpioMapTblPtr->PinId, newState, gpioMapTblPtr->LastKnownGpioState);
#endif
    upd_forward_interrupt_to_core(gpioMapTblPtr, newState);
    gpioMapTblPtr->LastKnownGpioState = newState;
  }

  return OK;
}

//===============================================================
// This function is called every 100 microseconds when the timer
// is running
int upd_periodic_timeout_isr(int irq, void *context, void *arg)
{
  int result;
  struct interruptPinMap_s *gpioMapTblPtr;

  // Acknowledge timer interrupt. Fortunately at this point we don't
  // care about which GPIO this is for.
  STM32_TIM_ACKINT(_periodicTimer, GTIM_SR_UIF);

  // Only needed if at least one gpio configured and active
  if(numbGpioConfigured == 0 || totalGpiosBeingMonitored == 0)
  {
    return OK;
  }

  // Look at all GPIOs to find those active.
  // p-m This could be optimized. For loop plus one active gpio
  // takes about 4 usec with 1 gpio hard coded about 1 usec. Since
  // this happens for only short bursts, nothing has been done.
  for(int offset = 0; offset < MEADOW_UPD_F7_SUPPORTED_GPIOS; offset++)
  {
    gpioMapTblPtr = &gpioDebounceData[offset];

    // Monitoring Debounce or Glitch?
    if(gpioMapTblPtr->CurrentProcessState != updipstate_mon_glitch &&
        gpioMapTblPtr->CurrentProcessState != updipstate_mon_debounce)
      continue;   // This GPIO is not waiting for timer interrupts

    if(gpioMapTblPtr->CurrentProcessState == updipstate_mon_debounce)
    {
      //----- Debounce Filtering -----
      result = upd_process_gpio_debounce(gpioMapTblPtr);
      if(result == gadrv_keepwaiting)
        continue;

      if(result == gadrv_break)
        break;
    }

    if(gpioMapTblPtr->CurrentProcessState == updipstate_mon_glitch)
    {
      //----- Glitch Filtering -----
      result = upd_process_gpio_glitch(gpioMapTblPtr);
      if(result == gadrv_keepwaiting)
        continue;

      // We reached the end of the glitch filtering
      // Should we switch to debounce?
      if(gpioMapTblPtr->DebounceRequestedDuration > 0 && result == gadrv_validtransitiondetected)
      {
        // Debounce is also configured for > 0 duration and this was not a glitch
        gpioMapTblPtr->DebounceDownCounter = gpioMapTblPtr->DebounceRequestedDuration;
        gpioMapTblPtr->CurrentProcessState = updipstate_mon_debounce;
        continue;
      }
      else
      {
        // Terminate capture for this GPIO since nothing else to do
        totalGpiosBeingMonitored--;
        gpioMapTblPtr->CurrentProcessState = updipstate_wait_gpio_isr;
        if(totalGpiosBeingMonitored == 0)
          break;    // Cannot be more work to do, so quit loop
      }
    }
  }

  // Stop Timer if no other GPIO needs it
  if(totalGpiosBeingMonitored == 0)
  {
    int ret = STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_DISABLED);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-0x%02x udp-(time isr)--STM32_TIM_SETMODE failed:%d\n",
                __FILE__, __LINE__, gpioMapTblPtr->PinId, ret);
      return ret;
    }
  }
  return OK;
}

