WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/meadow-upd-interrupt.c
  if(_isInitializationNeeded)
  {
    // Only do this once, the first time
    ret = upd_config_interrupt_prep_timer(MEADOW_UPD_INTERRUPT_STM32F7_TIMER_NUMBER);
    if(ret < 0)
    {
      syslog(LOG_ERR, "upd-(cfg)---upd_config_interrupt_prep_timer failed\n");
      return -1;
    }
    _isInitializationNeeded = false;
  }

  if(cfg->enable)
  {
    // Account for the number of GPIOs configured, don't double dip
    if(gpioMapTblPtr->CurrentProcessState != updipstate_uncfg)
        numbGpioConfigured--;

    gpioMapTblPtr->CurrentProcessState = updipstate_beingcfg;

    // Get the current GPIO state which can may be used to when processing
    // interrupts
    // uint32_t idrRegisterValues = *((uint32_t *)(gpioMapTblPtr->IDRAddress));
    // uint8_t pinNumb = gpioMapTblPtr->PinId & 0x0f;
    // gpioMapTblPtr->LastKnownGpioState = (idrRegisterValues & (1 << pinNumb)) > 0 ? 1 : 0;
    gpioMapTblPtr->LastKnownGpioState = upd_read_current_gpio_state(gpioMapTblPtr);
    gpioMapTblPtr->GlitchPrevGpioState = gpioMapTblPtr->LastKnownGpioState;

    // Note: the available configuration is 0.0 (none), 0.1 - 1000 millisec.
    // Foundation.Core will supply a value of 0, 1 - 10000. Since the timer 
    // is set at 100 usec then the count provided is the same as the number
    // of timer timeouts received.

    gpioMapTblPtr->DebounceRequestedDuration = cfg->debounceDuration;
    
    // Glitch config
    gpioMapTblPtr->GlitchRequestedDuration = cfg->glitchDuration;      
    gpioMapTblPtr->GlitchTimeoutsCounter = 0;

    // none = 0, rising = 1, falling = 2 & both = 3 (must match F7GPIOManager_interrupts.cs
    // in WireInterrupt()
    gpioMapTblPtr->GpioInterruptMode = (cfg->risingEdge & 0x01) | (cfg->fallingEdge & 0x01) << 1;

    // cfgset contains 20-bits of data. It is required by the Nuttx stm32_gpiosetevent
    // function. This function will reconfigure the GPIO based on the data in cfgset.
    // See stm32_gpio.h for more information.
    // Inputs: MMUU .... ...X PPPP BBBB
    // MM = Mode for input (this is 00)
    // UU = pull up, pull down or float
    // X  = is external interrupt selection, stm32_gpiosetevent sets this
    uint32_t cfgset = (designator & 0x000000ff);   // Port and Pin as well as clear MM

    switch(cfg->resistorMode)
    {
      case 0: // Float
        cfgset |= GPIO_FLOAT;
        break;    // 0 = do nothing
      case 1: // Pull up
        cfgset |= GPIO_PULLUP;
        break;
      case 2: // Pull down
        cfgset |= GPIO_PULLDOWN;
        break;
    }

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_DEBUG, "upd-(cfg)- 0x%02x (P%c%d)-Enabled-LKS:%d, GLDuration:%d, DBDuration:%d, InterruptMode:%d, cfgset:0x%08x\n",
              gpioMapTblPtr->PinId,
              ((gpioMapTblPtr->PinId) >> 4) + 'A', gpioMapTblPtr->PinId & 0x0f,
              gpioMapTblPtr->LastKnownGpioState,
              gpioMapTblPtr->GlitchRequestedDuration,
              gpioMapTblPtr->DebounceRequestedDuration,
              gpioMapTblPtr->GpioInterruptMode,
              cfgset);
#endif

    // Tell Nuttx about interrupt parameters
    if(gpioMapTblPtr->GlitchRequestedDuration > 0)
    {
      // For Glitch we must receive both rising and falling or we cannot keep
      // LastKnownGpioState accurate. After a stable state is reached we save
      // this value. Without this we couldn't send rising and falling correctly
      // to Meadow.Core
      ret = stm32_gpiosetevent(
      cfgset,               // special gpio for call
      1,                    // risingEdge,
      1,                    // fallingEdge,
      0,                    // event
      upd_gpio_interrupt,   // function to call
      gpioMapTblPtr);       // table entry pointer
    }
    else
    {
      // For Debounce we cannot know the GPIOs state for certain when we receive
      // the interrupt notification, so we rely on the MCU only sending interrupts
      // based on the rising and falling configuration. For Both it's a guess.
      ret = stm32_gpiosetevent(
      cfgset,               // special gpio for call
      cfg->risingEdge,      // risingEdge,
      cfg->fallingEdge,     // fallingEdge,
      0,                    // event
      upd_gpio_interrupt,   // function to call
      gpioMapTblPtr);       // table entry pointer
    }
    
    numbGpioConfigured++;
    gpioMapTblPtr->CurrentProcessState = updipstate_wait_gpio_isr;
  }
  else
  {
    // Disable
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(LOG_DEBUG, "udp-(cfg)-0x%02x (P%c%d)--Disabling GPIO\n", gpioMapTblPtr->PinId,
              ((gpioMapTblPtr->PinId) >> 4) + 'A', gpioMapTblPtr->PinId & 0x0f);
#endif

    // If not configured nothing to do
    if(gpioMapTblPtr->CurrentProcessState == updipstate_uncfg)
    {
      return OK;
    }

    numbGpioConfigured--;
    gpioMapTblPtr->CurrentProcessState = updipstate_uncfg;

    // Tell Nuttx to forget about interrupt
    ret = stm32_gpiosetevent(
        gpioMapTblPtr->PinId,
        0, 0, 0, NULL, NULL);
  }

  return ret;
}
